zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_crypto_core_ecc_eddsa.c
    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, ab_double, 2u * size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    CY_CRYPTO_VU_UMUL (base, ab_double, my_a, my_b);

    /* Barrett reduction */
    tmpResult = Cy_Crypto_Core_EDDSA_Bar_MulRed(base, my_z, ab_double, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    CY_CRYPTO_VU_FREE_MEM (base, CY_CRYPTO_VU_REG_BIT(ab_double));

    CY_CRYPTO_VU_POP_REG (base);

    return CY_CRYPTO_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_ED25519_SquareMod
****************************************************************************//**
*
* Modular squaring in GF(VR_P).
*
* \param base
* The pointer to a Crypto instance.
*
* \param z
* Result = a * a % mod. Register index for product value.
*
* \param a
* Register index for multiplicand and multiplier value.
*
* \param size
* Bit size.
*
* \return status code. See \ref cy_en_crypto_status_t.
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_ED25519_SquareMod( CRYPTO_Type *base,
    uint32_t z,
    uint32_t a,
    uint32_t size)
{
    return Cy_Crypto_Core_ED25519_MulMod( base, z, a, a, size);
}

#if defined(CY_CRYPTO_CFG_EDDSA_C)
static void Cy_Crypto_Core_ED25519_dom2_ctx( CRYPTO_Type *base, cy_en_eddsa_sig_type_t sigType, const uint8_t *ctx,
                uint32_t ctx_len, cy_stc_crypto_sha_state_t *shaState )
{
    uint8_t ct_init_string[] = "SigEd25519 no Ed25519 collisions";
    uint8_t ct_flag;
    uint8_t ct_ctx_len = (uint8_t)(ctx_len & 0xffu);

    ct_flag = (sigType == CY_CRYPTO_EDDSA_CTX)? (uint8_t)0: (uint8_t)1;
    /*Note: Can merge to one update call*/
    (void)Cy_Crypto_Core_Sha_Update(base, shaState, (uint8_t const*)ct_init_string, 32u);
    (void)Cy_Crypto_Core_Sha_Update(base, shaState, (uint8_t const*)&ct_flag, 1u);
    (void)Cy_Crypto_Core_Sha_Update(base, shaState, (uint8_t const*)&ct_ctx_len, 1u);

    if( ctx != NULL && ctx_len > 0u)
    {
        (void)Cy_Crypto_Core_Sha_Update(base, shaState, ctx, ctx_len );

    }
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_ED25519Add
****************************************************************************//**
* ED25519 (Edwards and Twisted Edwards) point add on projective coordinates in GF(VR_P).
*
* Add for: R = P + Q
*
* https://hyperelliptic.org/EFD/g1p/auto-code/twisted/projective/addition/add-2008-bbjlp.op3
* with
* P = (X1, Z1)
* Q = (X2, Z2)
* R = (X3, Z3)
* and eliminating temporary variables t0, t3, ..., t9.
*
* Cost: 10M + 1S
*
* \param base
* The pointer to a Crypto instance.
*
* \param s_x
* Register index for  projective X coordinate.
*
* \param s_y
* Register index for  projective Y coordinate.
*
* \param s_z
* Register index for  projective Z coordinate.
*
* \param t_x
* Register index for affine X coordinate.
*
* \param t_y
* Register index for affine Y coordinate.
*
* \param size
* Bit size.
*
* \return status code. See \ref cy_en_crypto_status_t.
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_ED25519Add(CRYPTO_Type *base,
    cy_stc_crypto_edw_dp_type *edwDp,
    uint32_t s_x,
    uint32_t s_y,
    uint32_t s_z,
    uint32_t t_x,
    uint32_t t_y,
    uint32_t size
)
{
    uint32_t t1    = 1u;
    uint32_t b     = 0u;
    uint32_t c     = 3u;
    uint32_t d     = 4u;
    uint32_t e     = 5u;
    uint32_t f     = 6u;
    uint32_t g     = 7u;
    uint32_t my_s_x = 8u;
    uint32_t my_s_y = 9u;
    uint32_t my_s_z = 10u;
    uint32_t my_t_x = 11u;
    uint32_t my_t_y = 12u;
    uint32_t t2;
    uint32_t r_s_x, r_s_y, r_s_z, r_t_x, r_t_y;

    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    CY_CRYPTO_VU_PUSH_REG (base);

    CY_CRYPTO_VU_SAVE_REG(base, s_x, &r_s_x);
    CY_CRYPTO_VU_SAVE_REG(base, s_y, &r_s_y);
    CY_CRYPTO_VU_SAVE_REG(base, s_z, &r_s_z);
    CY_CRYPTO_VU_SAVE_REG(base, t_x, &r_t_x);
    CY_CRYPTO_VU_SAVE_REG(base, t_y, &r_t_y);

    CY_CRYPTO_VU_RESTORE_REG(base, my_s_x, r_s_x);
    CY_CRYPTO_VU_RESTORE_REG(base, my_s_y, r_s_y);
    CY_CRYPTO_VU_RESTORE_REG(base, my_s_z, r_s_z);
    CY_CRYPTO_VU_RESTORE_REG(base, my_t_x, r_t_x);
    CY_CRYPTO_VU_RESTORE_REG(base, my_t_y, r_t_y);

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, t1, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, b, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, c, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, d, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, e, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, f, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, g, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    /* A = Z1*Z2 */
    /* Z2 = 1 skip first step
    Note: Revisit if we randomize the base points*/
    /* B = A^2 */
    tmpResult = Cy_Crypto_Core_ED25519_SquareMod( base, b, my_s_z, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /* C = X1*X2 */
    tmpResult =Cy_Crypto_Core_ED25519_MulMod( base, c, my_s_x, my_t_x, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /* D = Y1*Y2 */
    tmpResult =Cy_Crypto_Core_ED25519_MulMod( base, d, my_s_y, my_t_y, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /* E = d*C*D */
    Cy_Crypto_Core_Vu_SetMemValue (base, t1, (uint8_t const *)CY_REMAP_ADDRESS_FOR_CRYPTO(edwDp->d), size);
    tmpResult =Cy_Crypto_Core_ED25519_MulMod( base, f, c, d, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult =Cy_Crypto_Core_ED25519_MulMod( base, e, f, t1, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /* F = B-E */
    Cy_Crypto_Core_EC_SubMod( base, f, b, e);
    /* G = B+E */
    Cy_Crypto_Core_EC_AddMod( base, g, b, e);
    /* X3 = A*F*((X1+Y1)*(X2+Y2)-C-D) */
    t2 = b;
    Cy_Crypto_Core_EC_AddMod( base, t1, my_s_x, my_s_y);
    Cy_Crypto_Core_EC_AddMod( base, t2, my_t_x, my_t_y);

