zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_crypto_core_ecc_eddsa.c
    tmpResult =Cy_Crypto_Core_ED25519_MulMod( base, my_s_x, t1, t2, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    Cy_Crypto_Core_EC_SubMod( base, my_s_x, my_s_x, c);
    Cy_Crypto_Core_EC_SubMod( base, my_s_x, my_s_x, d);

    tmpResult = Cy_Crypto_Core_ED25519_MulMod( base, t1, my_s_z, f, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = Cy_Crypto_Core_ED25519_MulMod( base, my_s_x, my_s_x, t1, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    /* Y3 = A*G*(D-a*C) */
    Cy_Crypto_Core_Vu_SetMemValue (base, t1, (uint8_t const *)CY_REMAP_ADDRESS_FOR_CRYPTO(edwDp->a), size);
    tmpResult =Cy_Crypto_Core_ED25519_MulMod( base, t2, my_s_z, g, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult =Cy_Crypto_Core_ED25519_MulMod( base, t1, t1, c, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    Cy_Crypto_Core_EC_SubMod( base, my_s_y, d, t1);
    tmpResult =Cy_Crypto_Core_ED25519_MulMod( base, my_s_y, my_s_y, t2, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    /* Z3 = F*G */
    tmpResult =Cy_Crypto_Core_ED25519_MulMod( base, my_s_z, f, g, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    CY_CRYPTO_VU_FREE_MEM (base, CY_CRYPTO_VU_REG_BIT(t1) | CY_CRYPTO_VU_REG_BIT(b) |
                                 CY_CRYPTO_VU_REG_BIT(c) | CY_CRYPTO_VU_REG_BIT(d)  |
                                 CY_CRYPTO_VU_REG_BIT(e) | CY_CRYPTO_VU_REG_BIT(f)  |
                                 CY_CRYPTO_VU_REG_BIT(g));

    CY_CRYPTO_VU_POP_REG (base);

    return CY_CRYPTO_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_ED25519Double
****************************************************************************//**
*
* ED25519 (Edwards and Twisted Edwards) point doubling on projective coordinates in GF(VR_P).
*
* Double for: R = 2 * P for both Edwards and Twisted Edwards curves in projective
* coordinates.
*
* https://hyperelliptic.org/EFD/g1p/auto-code/twisted/projective/doubling/dbl-2008-bbjlp.op3
* with
* P = (X1, Z1)
* R = (X3, Z3)
* and eliminating H and temporary variables t0, ..., t4.
*
* Cost: 3M + 4S
*
* \param base
* The pointer to a Crypto instance.
*
* \param s_x
* Register index for projective X coordinate.
*
* \param s_y
* Register index for projective Y coordinate.
*
* \param s_z
* Register index for projective Z coordinate.
*
* \param size
* Bit size.
*
* \return status code. See \ref cy_en_crypto_status_t.
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_ED25519Double(CRYPTO_Type *base,
    cy_stc_crypto_edw_dp_type *edwDp,
    uint32_t s_x,
    uint32_t s_y,
    uint32_t s_z,
    uint32_t size
)
/* 3M + 4S */
{
    uint32_t b      = 1u;
    uint32_t c      = 0u;
    uint32_t d      = 3u;
    uint32_t e      = 4u;
    uint32_t f      = 5u;
    uint32_t j      = 6u;
    uint32_t my_s_x = 7u;
    uint32_t my_s_y = 8u;
    uint32_t my_s_z = 9u;
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    CY_CRYPTO_VU_PUSH_REG (base);

    CY_CRYPTO_VU_LD_REG(base, my_s_x, s_x);
    CY_CRYPTO_VU_LD_REG(base, my_s_y, s_y);
    CY_CRYPTO_VU_LD_REG(base, my_s_z, s_z);

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, b, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, c, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, d, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, e, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, f, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    Cy_Crypto_Core_Vu_SetMemValue (base, f, (uint8_t const *)CY_REMAP_ADDRESS_FOR_CRYPTO(edwDp->a), size);

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, j, size+1u);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    /* B = (X1 + Y1)^2 */
    Cy_Crypto_Core_EC_AddMod( base, b, my_s_x, my_s_y);
    tmpResult = Cy_Crypto_Core_ED25519_SquareMod( base, b, b, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /* C = X1^2 */
    tmpResult = Cy_Crypto_Core_ED25519_SquareMod( base, c, my_s_x, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /* D = Y1^2 */
    tmpResult = Cy_Crypto_Core_ED25519_SquareMod( base, d, my_s_y, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /* E = eddp->a*C */
    tmpResult = Cy_Crypto_Core_ED25519_MulMod( base, e, f, c, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /* F = E+D */
    Cy_Crypto_Core_EC_AddMod( base, f, e, d);
    /* J = F - 2*(Z1^2) */
    tmpResult = Cy_Crypto_Core_ED25519_SquareMod( base, j, my_s_z, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /*2*(Z1^2) mod p*/
    Cy_Crypto_Core_EC_AddMod( base, j, j, j);
    Cy_Crypto_Core_EC_SubMod (base, j, f, j);
    /* X3 = (B-C-D)*J */
    Cy_Crypto_Core_EC_SubMod (base, b, b, c);
    Cy_Crypto_Core_EC_SubMod (base, b, b, d);
    tmpResult = Cy_Crypto_Core_ED25519_MulMod( base, my_s_x, b, j, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /* Y3 = F*(E-D) */
    Cy_Crypto_Core_EC_SubMod (base, e, e, d);
    tmpResult = Cy_Crypto_Core_ED25519_MulMod( base, my_s_y, f, e, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /* Z3 = F*J */
    tmpResult = Cy_Crypto_Core_ED25519_MulMod( base, my_s_z, f, j, size);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    CY_CRYPTO_VU_FREE_MEM (base, CY_CRYPTO_VU_REG_BIT(b) | CY_CRYPTO_VU_REG_BIT(c) |
                                 CY_CRYPTO_VU_REG_BIT(d) | CY_CRYPTO_VU_REG_BIT(e) |
                                 CY_CRYPTO_VU_REG_BIT(f) | CY_CRYPTO_VU_REG_BIT(j) );
    CY_CRYPTO_VU_POP_REG (base);

