zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_crypto_core_ecc_eddsa.c
    return tmpResult;
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_ED25519_PointMul
****************************************************************************//**
*
* Edward 25519 Elliptic curve point multiplication in GF(p).
*
* \param base
* The pointer to a Crypto instance.
*
* \param p_x
* Register index for affine X coordinate of base point.
*
* \param p_y
* Register index for affine Y coordinate of base point.
*
* \param p_d
* Register index for multiplication value.
*
* \param bitsize
* Bit size of the used curve.
*
* \return status code. See \ref cy_en_crypto_status_t.
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_ED25519_PointMul(CRYPTO_Type *base, cy_stc_crypto_edw_dp_type *edwDp, uint32_t p_x, uint32_t p_y, uint32_t p_d, uint32_t bitsize)
{
    /* Note: Pre conditions 0 < px, py < p-1 (consider randomizing the base point)*/

    uint32_t i;
    uint32_t status;
    uint32_t carry;
    uint16_t clsame;
    uint32_t loop;

    uint32_t clr     = 5u;
    uint32_t t       = 6u;
    uint32_t my_s_x  = 7u;
    uint32_t my_s_y  = 8u;
    uint32_t my_s_z  = 9u;
    uint32_t my_t_x  = 10u;
    uint32_t my_t_y  = 11u;
    uint32_t my_d    = 12u;
    uint32_t r_p_x, r_p_y, r_p_d;

    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    CY_CRYPTO_VU_PUSH_REG (base);

    CY_CRYPTO_VU_SAVE_REG(base, p_x, &r_p_x);
    CY_CRYPTO_VU_SAVE_REG(base, p_y, &r_p_y);
    CY_CRYPTO_VU_SAVE_REG(base, p_d, &r_p_d);

    CY_CRYPTO_VU_RESTORE_REG(base, my_s_x, r_p_x);
    CY_CRYPTO_VU_RESTORE_REG(base, my_s_y, r_p_y);
    CY_CRYPTO_VU_RESTORE_REG(base, my_d, r_p_d);

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, clr, bitsize+1u);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, t, bitsize);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, my_s_z, bitsize);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, my_t_x, bitsize);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, my_t_y, bitsize);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /* load prime defining the curve as well as the barrett coefficient. */
    /* VR_P and VR_BARRETT_U are "globally" defined in cy_crypto_core_ecc.h */
    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, VR_P, bitsize);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    Cy_Crypto_Core_Vu_SetMemValue (base, VR_P, (uint8_t const *)CY_REMAP_ADDRESS_FOR_CRYPTO(edwDp->prime), bitsize);

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, VR_BARRETT, edwDp->barret_psize);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    Cy_Crypto_Core_Vu_SetMemValue (base, VR_BARRETT, (uint8_t const*)CY_REMAP_ADDRESS_FOR_CRYPTO(edwDp->barrett_p), edwDp->barret_psize);


    CY_CRYPTO_VU_MOV (base, my_t_x, my_s_x);
    CY_CRYPTO_VU_MOV (base, my_t_y, my_s_y);

    /* init point->z to 1. */
    CY_CRYPTO_VU_SET_TO_ONE (base, my_s_z);

    /* EC scalar multiplication (irregular) operation. */
    CY_CRYPTO_VU_SET_TO_ZERO (base, clr);
    CY_CRYPTO_VU_CLSAME (base, t, my_d, clr);

    /* This is needed, otherwise clsame is wrong */
    Cy_Crypto_Core_Vu_WaitForComplete(base);

    clsame = Cy_Crypto_Core_Vu_RegDataPtrRead (base, t);

    CY_CRYPTO_VU_LSL  (base, my_d, my_d, t); /* Get rid of leading '0's */
    CY_CRYPTO_VU_LSL1 (base, my_d, my_d);    /* Get rid of leading '1' */

    /* Binary left-to-right algorithm
    * Perform point addition and point doubling to implement scalar multiplication
    * Scan the bits of the scalar from left to right; perform point doubling for each bit,
    * and perform point addition when the bit is set.
    * Carry set if current bit is equal to 1 (hence, perform point addition - point
    * doubling is always performed)
    */
    if( bitsize >= clsame)
    {
        loop = (uint32_t)(bitsize - clsame);
    }
    else
    {
        return CY_CRYPTO_HW_ERROR;
    }

    for (i = 0; i < (loop); i++)
    {
        /* Carry set if current bit is equal to 1 (hence, perform point addition - point
        * doubling is always performed)
        */
        CY_CRYPTO_VU_LSL1 (base, my_d, my_d);
        status = Cy_Crypto_Core_Vu_StatusRead(base);

        carry = status & CY_CRYPTO_VU_STATUS_CARRY_BIT;

        tmpResult = Cy_Crypto_Core_ED25519Double (base, edwDp, my_s_x, my_s_y, my_s_z, bitsize);

        if(CY_CRYPTO_SUCCESS != tmpResult)
        {
            return tmpResult;
        }

        if (carry != 0u)
        {
            tmpResult = Cy_Crypto_Core_ED25519Add (base, edwDp, my_s_x, my_s_y, my_s_z, my_t_x, my_t_y, bitsize);

            if(CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }
        }
    }
    Cy_Crypto_Core_Vu_WaitForComplete(base);
    /* Inverse transform */
    tmpResult = Cy_Crypto_Core_ED25519InvTransform(base, my_s_x, my_s_y, my_s_z, bitsize);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    Cy_Crypto_Core_Vu_WaitForComplete(base);
    CY_CRYPTO_VU_FREE_MEM (base, CY_CRYPTO_VU_REG_BIT(my_s_z) | CY_CRYPTO_VU_REG_BIT(my_t_x) |
                                 CY_CRYPTO_VU_REG_BIT(my_t_y) | CY_CRYPTO_VU_REG_BIT(t) |
                                 CY_CRYPTO_VU_REG_BIT(VR_P)   | CY_CRYPTO_VU_REG_BIT(VR_BARRETT) |
                                 CY_CRYPTO_VU_REG_BIT(clr) );


    CY_CRYPTO_VU_POP_REG (base);

    return tmpResult;
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_ED25519_PointMultiplication
****************************************************************************//**
*
* Edwards 25519 elliptic curve point multiplication in GF(p).
*
* For CAT1C & CAT1D devices when D-Cache is enabled parameters ecpGX,ecpGY,ecpD,ecpQX and ecpQY must align and end in 32 byte boundary.
*
* \param base
* The pointer to a Crypto instance.
*
* \param curveID
* See \ref cy_en_crypto_ecc_curve_id_t.
*
* \param ecpGX
* X coordinate of base point.
*
* \param ecpGY
* Y coordinate of base point.
*
* \param ecpD
* multiplication scalar value.
*
* \param ecpQX
* X coordinate of result point.
*
* \param ecpQY
* Y coordinate of result point.
*
* \return status code. See \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_ED25519_PointMultiplication(CRYPTO_Type *base,
    cy_en_crypto_ecc_curve_id_t curveID,
    const uint8_t *ecpGX,
    const uint8_t *ecpGY,
    const uint8_t *ecpD,
    uint8_t *ecpQX,
    uint8_t *ecpQY)
{
    cy_stc_crypto_edw_dp_type edw_Dp;
    cy_stc_crypto_edw_dp_type *edwDp = &edw_Dp;

