zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_crypto_core_ecc_eddsa.c
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_NOT_SUPPORTED;

    if(CY_CRYPTO_SUCCESS == Cy_Crypto_Core_EDW_GetCurveParams(edwDp, curveID))
    {
        uint32_t bitsize;

        bitsize   = edwDp->size;
        tmpResult = CY_CRYPTO_BAD_PARAMS;

        if ((NULL != ecpGX) && (NULL != ecpGY) && (NULL != ecpD) && (NULL != ecpQX) && (NULL != ecpQY))
        {
            uint8_t *ecpGXRemap;
            uint8_t *ecpGYRemap;
            uint8_t *ecpDRemap;
            uint8_t *ecpQXRemap;
            uint8_t *ecpQYRemap;

            ecpGXRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(ecpGX);
            ecpGYRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(ecpGY);
            ecpDRemap  = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(ecpD);
            ecpQXRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(ecpQX);
            ecpQYRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(ecpQY);

            /* Public parameters and characteristics of elliptic curve */
            tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, VR_D, bitsize+1u);        /* Scalar factor */
            if(CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }

            tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, VR_S_X, bitsize);
            if(CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }

            tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, VR_S_Y, bitsize);
            if(CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }

            Cy_Crypto_Core_Vu_SetMemValue (base, VR_S_X, ecpGXRemap, bitsize);
            Cy_Crypto_Core_Vu_SetMemValue (base, VR_S_Y, ecpGYRemap, bitsize);
            Cy_Crypto_Core_Vu_SetMemValue (base, VR_D, ecpDRemap, bitsize+1u);

            /* ECC calculation: d * G mod p */
            tmpResult = Cy_Crypto_Core_ED25519_PointMul(base, edwDp, VR_S_X, VR_S_Y, VR_D, bitsize);

            if(CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }

            /* Get result P = (X,Y) = d.G from Ed25519 scalar multiplication */
            Cy_Crypto_Core_Vu_GetMemValue (base, ecpQXRemap, VR_S_X, bitsize);
            Cy_Crypto_Core_Vu_GetMemValue (base, ecpQYRemap, VR_S_Y, bitsize);

            Cy_Crypto_Core_Vu_WaitForComplete(base);
            /* Free memory */
            CY_CRYPTO_VU_FREE_MEM (base,
                                    CY_CRYPTO_VU_REG_BIT(VR_S_Y) |
                                    CY_CRYPTO_VU_REG_BIT(VR_S_X) |
                                    CY_CRYPTO_VU_REG_BIT(VR_D));

            tmpResult = CY_CRYPTO_SUCCESS;
        }
    }

    return tmpResult;
}
#endif /*#if defined(CY_CRYPTO_CFG_EDDSA_C)*/

#if defined (CY_CRYPTO_CFG_EDDSA_GENKEY_C)
/*******************************************************************************
* Function Name: Cy_Crypto_Core_ED25519_MakePublicKey
****************************************************************************//**
*
* Make a new ED25519 public key
*
* For CAT1C & CAT1D devices when D-Cache is enabled parameters privateKey, publicKey( x&y) must align and end in 32 byte boundary.
*
* \param base
* The pointer to a Crypto instance.
*
* \param curveID
* See \ref cy_en_crypto_ecc_curve_id_t.
*
* \param privateKey
* [in] Private key.
*
* \param publicKey
* [out] Newly created Public key.
* See \ref cy_stc_crypto_ecc_key.
*
* \return status code. See \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_ED25519_MakePublicKey(CRYPTO_Type *base,
        cy_en_crypto_ecc_curve_id_t curveID,
        const uint8_t *privateKey,
        cy_stc_crypto_ecc_key *publicKey)
{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_NOT_SUPPORTED;

    cy_stc_crypto_edw_dp_type edw_Dp;
    cy_stc_crypto_edw_dp_type *edwDp = &edw_Dp;
    uint8_t *privateKeyRemap;
    uint8_t *publicKeyXRemap;
    uint8_t *publicKeyYRemap;
    uint8_t *digest;

    if(CY_CRYPTO_SUCCESS == Cy_Crypto_Core_EDW_GetCurveParams(edwDp, curveID))
    {
        if ((privateKey != NULL) && (publicKey != NULL) &&
            (publicKey->pubkey.x != NULL) && (publicKey->pubkey.y != NULL))
        {
#if (CY_IP_MXCRYPTO_VERSION == 1u)
            cy_stc_crypto_v1_sha512_buffers_t shaBuffers_t;
            cy_stc_crypto_sha_state_t shaHashState_t;
            cy_stc_crypto_sha_state_t *shaHashState = &shaHashState_t;
            cy_stc_crypto_v1_sha512_buffers_t *shaBuffers = &shaBuffers_t;
#else
            uint8_t shaBuffers_t[CY_CRYPTO_ALIGN_CACHE_LINE(sizeof(cy_stc_crypto_v2_sha512_buffers_t)) + CY_CRYPTO_DCAHCE_PADDING_SIZE];
            uint8_t shaHashState_t[CY_CRYPTO_ALIGN_CACHE_LINE(sizeof(cy_stc_crypto_sha_state_t)) + CY_CRYPTO_DCAHCE_PADDING_SIZE];
            cy_stc_crypto_v2_sha512_buffers_t *shaBuffers = (cy_stc_crypto_v2_sha512_buffers_t *)CY_CRYPTO_DCAHCE_ALIGN_ADDRESS(shaBuffers_t);
            cy_stc_crypto_sha_state_t *shaHashState = (cy_stc_crypto_sha_state_t *)CY_CRYPTO_DCAHCE_ALIGN_ADDRESS(shaHashState_t);
#endif

            uint32_t bitsize  = edwDp->size;
            uint32_t bytesize = CY_CRYPTO_BYTE_SIZE_OF_BITS(edwDp->size);

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
            /* Flush the cache */
            SCB_CleanDCache_by_Addr((volatile void *)privateKey,(int32_t)CY_CRYPTO_BYTE_SIZE_OF_BITS(bitsize));
#endif
            privateKeyRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(privateKey);
            publicKeyXRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(publicKey->pubkey.x);
            publicKeyYRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(publicKey->pubkey.y);

            uint32_t p_d = 10u;       /* private key */
            uint32_t p_x = 11u;       /* x coordinate */
            uint32_t p_y = 12u;       /* y coordinate */
            uint32_t p_sha = 4u;      /* digest */

            tmpResult = Cy_Crypto_Core_Sha_Init(base, shaHashState, (cy_en_crypto_sha_mode_t)CY_CRYPTO_MODE_SHA512, (void *)shaBuffers);
            if (CY_CRYPTO_SUCCESS == tmpResult)
            {
                tmpResult = Cy_Crypto_Core_Sha_Start(base, shaHashState);
                if(CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
            }
            else
            {
                return tmpResult;
            }

            tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, p_x, bitsize);
            if(CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }

            tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, p_y, bitsize);
            if(CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }

            tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, p_sha, (CY_CRYPTO_SHA512_HASH_SIZE*8u));
            if(CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }
            digest = (uint8_t *)Cy_Crypto_Core_Vu_RegMemPointer(base, p_sha);
            /*Base Point, G = (p_x, p_y) */
            Cy_Crypto_Core_Vu_SetMemValue (base, p_x, (uint8_t const *)CY_REMAP_ADDRESS_FOR_CRYPTO(edwDp->Gx), bitsize);
            Cy_Crypto_Core_Vu_SetMemValue (base, p_y, (uint8_t const *)CY_REMAP_ADDRESS_FOR_CRYPTO(edwDp->Gy), bitsize);

            /* Load private key */
            tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, p_d, bitsize+1u);
            if(CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }

