zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_crypto_core_ecc_eddsa.c
            /*step1: Compute secret scalar 's' and prefix*/
            /*SHA expects big-endian input*/
            tmpResult = Cy_Crypto_Core_Sha_Update(base, shaHashState, (uint8_t const*)privateKeyRemap, bytesize);
            if(CY_CRYPTO_SUCCESS == tmpResult)
            {
                tmpResult = Cy_Crypto_Core_Sha_Finish(base, shaHashState, digest);
            }
            if(CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }

            /*Prune the buffer: The lowest three bits of the first octet are cleared, the highest bit of the last octet is cleared,
            and the second highest bit of the last octet is set.*/
            digest[0]  &= ~((uint8_t)0x7);
            digest[31] &= ~((uint8_t)0x80);
            digest[31] |= (uint8_t)0x40;

            /*s = digest[0-31] prefix = digest[32-63]*/
            Cy_Crypto_Core_Vu_SetMemValue(base, p_d, (uint8_t *)&digest[0], bitsize+1u);
            /* make the public key
             * ED25519 scalar point multiplication - X,Y-only co-Z arithmetic
             */
            tmpResult = Cy_Crypto_Core_ED25519_PointMul(base, edwDp, p_x, p_y, p_d, bitsize);
            if(CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }

            Cy_Crypto_Core_Vu_GetMemValue(base, (uint8_t *)publicKeyXRemap, p_x, bitsize);
            Cy_Crypto_Core_Vu_GetMemValue(base, (uint8_t *)publicKeyYRemap, p_y, bitsize);
#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
            SCB_InvalidateDCache_by_Addr(publicKey->pubkey.x, (int32_t)CY_CRYPTO_BYTE_SIZE_OF_BITS(bitsize));
            SCB_InvalidateDCache_by_Addr(publicKey->pubkey.y, (int32_t)CY_CRYPTO_BYTE_SIZE_OF_BITS(bitsize));
#endif
            publicKey->type = PK_PUBLIC;
            publicKey->curveID = curveID;

            Cy_Crypto_Core_Vu_WaitForComplete(base);
            CY_CRYPTO_VU_FREE_MEM(base, CY_CRYPTO_VU_REG_BIT(p_x) | CY_CRYPTO_VU_REG_BIT(p_y) |
                                        CY_CRYPTO_VU_REG_BIT(p_sha) | CY_CRYPTO_VU_REG_BIT(p_d));
            /* free sha context*/
            (void)Cy_Crypto_Core_Sha_Free(base, shaHashState);
            tmpResult = CY_CRYPTO_SUCCESS;
        }
    }

    return (tmpResult);
}
#endif /* defined (CY_CRYPTO_CFG_EDDSA_GENKEY_C)*/

#if defined(CY_CRYPTO_CFG_EDDSA_SIGN_C)
/*******************************************************************************
* Function Name: Cy_Crypto_Core_ED25519_Sign
****************************************************************************//**
*
* Sign a message.
*
* For CAT1C & CAT1D devices when D-Cache is enabled parameters hash, sig, key(k) and sigctx must align and end in 32 byte boundary.
*
* \param base
* The pointer to a Crypto instance.
*
* \param hash
* The message to sign. Provided as is in data buffer. This is usually the hash of
* the original data to be signed.
*
* \param hashlen
* The length of the message in bytes.
*
* \param sig
* [out] The destination for the signature, 'r' followed by 's'.
*
* \param key
* Key used for signature generation. See \ref cy_stc_crypto_ecc_key.
*
* \param sigType
* signature Type. CY_CRYPTO_EDDSA_PURE,CY_CRYPTO_EDDSA_CTX or CY_CRYPTO_EDDSA_PREHASH
*
* \param sigctx
* signature context. can be NULL if EDDSA_PURE is used or if no context is provided.
*
* \param sigctx_len
* The length of the signature context
*
* \return status code. See \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_ED25519_Sign(CRYPTO_Type *base, const uint8_t *hash, uint32_t hashlen, uint8_t *sig,
        const cy_stc_crypto_ecc_key *key, cy_en_eddsa_sig_type_t sigType,const uint8_t *sigctx, uint32_t sigctx_len)
{
     cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    uint8_t *sigPtrRemap;
    uint8_t *hashPtrRemap;
    uint8_t *keyKRemap;
    uint32_t mallocMask = 0u;

    cy_stc_crypto_edw_dp_type edwDp_t;
    cy_stc_crypto_edw_dp_type *edwDp = &edwDp_t;

    /* input param validation */
    if ( hash == NULL && 0u != hashlen )
    {
        return CY_CRYPTO_BAD_PARAMS;
    }
    /*
    Value of context is set by the signer and verifier (maximum of 255
    octets; the default is empty string, except for Ed25519, which can't
    have context) and has to match octet by octet for verification to be
    successful.
    */
    if(sigType != CY_CRYPTO_EDDSA_PURE)
    {
        if(sigType == CY_CRYPTO_EDDSA_CTX)
        {
            if( sigctx == NULL  || sigctx_len == 0u || sigctx_len > 255u)
            {
                return CY_CRYPTO_BAD_PARAMS;
            }
        }
        else
        {
            if (sigType == CY_CRYPTO_EDDSA_PREHASH && hashlen != CY_CRYPTO_SHA512_HASH_SIZE)
            {
                return CY_CRYPTO_BAD_PARAMS;
            }
        }
    }

    if ((sig != NULL) && (key != NULL) && (sigType < CY_CRYPTO_EDDSA_NONE))
    {
        tmpResult = CY_CRYPTO_NOT_SUPPORTED;

        hashPtrRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(hash);
        sigPtrRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(sig);
        keyKRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(key->k);

        if(CY_CRYPTO_SUCCESS == Cy_Crypto_Core_EDW_GetCurveParams(edwDp, key->curveID))
        {
#if (CY_IP_MXCRYPTO_VERSION == 1u)
            cy_stc_crypto_v1_sha512_buffers_t shaBuffers_t;
            cy_stc_crypto_sha_state_t shaHashState_t;
            cy_stc_crypto_sha_state_t *shaHashState = &shaHashState_t;
            cy_stc_crypto_v1_sha512_buffers_t *shaBuffers = &shaBuffers_t;
#else
            uint8_t shaBuffers_t[CY_CRYPTO_ALIGN_CACHE_LINE(sizeof(cy_stc_crypto_v2_sha512_buffers_t)) + CY_CRYPTO_DCAHCE_PADDING_SIZE];
            uint8_t shaHashState_t[CY_CRYPTO_ALIGN_CACHE_LINE(sizeof(cy_stc_crypto_sha_state_t)) + CY_CRYPTO_DCAHCE_PADDING_SIZE];
            cy_stc_crypto_v2_sha512_buffers_t *shaBuffers = (cy_stc_crypto_v2_sha512_buffers_t *)CY_CRYPTO_DCAHCE_ALIGN_ADDRESS(shaBuffers_t);
            cy_stc_crypto_sha_state_t *shaHashState = (cy_stc_crypto_sha_state_t *)CY_CRYPTO_DCAHCE_ALIGN_ADDRESS(shaHashState_t);
#endif
            uint32_t bitsize  = edwDp->size;
            uint32_t bytesize = CY_CRYPTO_BYTE_SIZE_OF_BITS(edwDp->size);

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
            /* Flush the cache */
            SCB_CleanDCache_by_Addr((volatile void *)hash,(int32_t)hashlen);
            SCB_CleanDCache_by_Addr((volatile void *)key->k, (int32_t)bytesize);
            /* sigctx is managed by the SHA functions */
#endif

            tmpResult = Cy_Crypto_Core_Sha_Init(base, shaHashState, (cy_en_crypto_sha_mode_t)CY_CRYPTO_MODE_SHA512, (void *)shaBuffers);
            if (CY_CRYPTO_SUCCESS == tmpResult)
            {
                tmpResult = Cy_Crypto_Core_Sha_Start(base, shaHashState);
            }

