zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_crypto_core_ecc_eddsa.c
                /* step5 */
                /* Mod reduction modulo n (order of the base point in VR_P and barret_o in VR_BARRET) */
                if ( CY_CRYPTO_SUCCESS != Cy_Crypto_Core_EDDSA_Bar_MulRed(base, p_temp, p_sha, bitsize) )
                {
                    return CY_CRYPTO_BAD_PARAMS;
                }

                CY_CRYPTO_VU_UMUL(base, p_sha, p_temp, p_s);
                CY_CRYPTO_VU_ADD(base, p_sha, p_sha, p_r);

                /* Mod reduction modulo n (order of the base point in VR_P and barret_o in VR_BARRET) */
                if ( CY_CRYPTO_SUCCESS != Cy_Crypto_Core_EDDSA_Bar_MulRed(base, p_s, p_sha, bitsize))
                {
                    return CY_CRYPTO_HW_ERROR;
                }

                /* copy s to sig buffer*/
                if (!Cy_Crypto_Core_Vu_IsRegZero(base, p_s))
                {
                    /* S is not zero!!! */
                    Cy_Crypto_Core_Vu_GetMemValue (base, &sigPtrRemap[bytesize], p_s, bitsize);
                }
                else
                {
                    tmpResult = CY_CRYPTO_HW_ERROR;
                }

                Cy_Crypto_Core_Vu_WaitForComplete(base);
                /* Free all mem allocations */
                CY_CRYPTO_VU_FREE_MEM(base, mallocMask);
                (void)Cy_Crypto_Core_Sha_Free(base, shaHashState);
#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
                CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to int32_t.');
                SCB_InvalidateDCache_by_Addr(sig, (int32_t)(bytesize*2U));
#endif
            }
        }
    }

    return (tmpResult);
}
#endif /* defined(CY_CRYPTO_CFG_EDDSA_SIGN_C) */

/*******************************************************************************
* Function Name: Cy_Crypto_Core_ED25519_ExpMod
****************************************************************************//**
*
* Modular exponentiation x = y^e mod p.
*
* \param base
* The pointer to a Crypto instance.
*
* \param p_x
* Register index for result X .
*
* \param p_y
* Register index for input integer Y.
*
* \param p_e
* Register index for exponent.
*
* \param bitsize
* Bit size of the input Y.
*
* \return status code. See \ref cy_en_crypto_status_t.
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_ED25519_ExpMod(CRYPTO_Type *base, uint32_t p_x,
                                                    uint32_t p_y, uint32_t p_e,
                                                    uint32_t bitsize)
{
    uint32_t i;
    uint32_t status;
    uint32_t carry;
    uint16_t clsame;
    uint32_t loop;

    uint32_t clr     = 5u;
    uint32_t t       = 6u;
    uint32_t my_s_x  = 7u;
    uint32_t my_s_y  = 8u;
    uint32_t my_e    = 9u;
    uint32_t r_p_x, r_p_y, r_p_e;

    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    CY_CRYPTO_VU_PUSH_REG (base);

    CY_CRYPTO_VU_SAVE_REG(base, p_x, &r_p_x);
    CY_CRYPTO_VU_SAVE_REG(base, p_y, &r_p_y);
    CY_CRYPTO_VU_SAVE_REG(base, p_e, &r_p_e);

    CY_CRYPTO_VU_RESTORE_REG(base, my_s_x, r_p_x);
    CY_CRYPTO_VU_RESTORE_REG(base, my_s_y, r_p_y);
    CY_CRYPTO_VU_RESTORE_REG(base, my_e, r_p_e);

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, clr, bitsize);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, t, bitsize);
    if(CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    /* normalize exp */
    CY_CRYPTO_VU_MOV (base, my_s_x, my_s_y);
    CY_CRYPTO_VU_SET_TO_ZERO (base, clr);
    CY_CRYPTO_VU_CLSAME (base, t, my_e, clr);
    /* This is needed, otherwise clsame is wrong */
    Cy_Crypto_Core_Vu_WaitForComplete(base);
    clsame = Cy_Crypto_Core_Vu_RegDataPtrRead (base, t);

    CY_CRYPTO_VU_LSL  (base, my_e, my_e, t); /* Get rid of leading '0's */
    CY_CRYPTO_VU_LSL1 (base, my_e, my_e);    /* Get rid of leading '1' */

    /* Binary left-to-right algorithm
    * Perform mul and squaring to implement exponential mod multiplication
    * Scan the bits of the exponent from left to right; perform squaring for each bit,
    * and perform mul when the bit is set. Carry set if current bit is equal to 1
    * (hence perform mul, squaring is always performed)
    */
    if( bitsize >= clsame)
    {
        loop = (uint32_t)(bitsize - clsame - 1u);
    }
    else
    {
        return CY_CRYPTO_HW_ERROR;
    }

    for (i = 0; i < (loop); i++)
    {
        /* Carry set if current bit is equal to 1 (hence, perform multiply,
        * squaring is always performed)
        */
        CY_CRYPTO_VU_LSL1 (base, my_e, my_e);
        status = Cy_Crypto_Core_Vu_StatusRead(base);

        carry = status & CY_CRYPTO_VU_STATUS_CARRY_BIT;

        tmpResult = Cy_Crypto_Core_ED25519_SquareMod( base, my_s_x, my_s_x, bitsize);

        if(CY_CRYPTO_SUCCESS != tmpResult)
        {
            return tmpResult;
        }

        if (carry != 0u)
        {
            (void)Cy_Crypto_Core_ED25519_MulMod (base, my_s_x, my_s_x, my_s_y, bitsize);
        }
    }

    Cy_Crypto_Core_Vu_WaitForComplete(base);
    /* free memory */
    CY_CRYPTO_VU_FREE_MEM (base, CY_CRYPTO_VU_REG_BIT(t) | CY_CRYPTO_VU_REG_BIT(clr));
    CY_CRYPTO_VU_POP_REG (base);

    return tmpResult;
}

#if defined(CY_CRYPTO_CFG_EDDSA_VERIFY_C)
/*******************************************************************************
* Function Name: Cy_Crypto_Core_ED25519_PointDecode
****************************************************************************//**
*
* Decode ED25519 encoded public key in to x and y
*
* For CAT1C & CAT1D devices when D-Cache is enabled parameters publicKey, pubKey_x and pubKey_y must align and end in 32 byte boundary.
*
* \param base
* The pointer to a Crypto instance.
*
* \param curveID
* See \ref cy_en_crypto_ecc_curve_id_t.
*
* \param publicKey
* [in] encoded 32 byte Public key.
*
* \param pubKey_x
* [out] Decoded 32 bytes Public key x in little-endian format.
*
* \param pubKey_y
* [out] Decoded 32 bytes Public key y in little-endian format.
*
* \return status code. See \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_ED25519_PointDecode(CRYPTO_Type *base,
        cy_en_crypto_ecc_curve_id_t curveID,
        const uint8_t *publicKey,
        uint8_t *pubKey_x, uint8_t *pubKey_y)
{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_NOT_SUPPORTED;

