zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_crypto_core_ecc_eddsa.c
    cy_stc_crypto_edw_dp_type edw_Dp;
    cy_stc_crypto_edw_dp_type *edwDp = &edw_Dp;
    uint8_t *publicKeyRemap;
    uint8_t *publicKeyXRemap;
    uint8_t *publicKeyYRemap;
    uint8_t x_0;

    /* (p-5)/8 */
    CY_ALIGN(4) static const uint8_t  ed25519_pb8_exp[CY_CRYPTO_ECC_ED25519_BYTE_SIZE] =
    {
        0xfd, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff,
        0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff,
        0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0x0f
    };
    /* 2^((p-1)/4) */
    CY_ALIGN(4)static const uint8_t ed25519_sqrt_m1[] =
    {
        0xB0, 0xA0, 0x0E, 0x4A, 0x27, 0x1B, 0xEE, 0xC4, 0x78, 0xE4, 0x2F, 0xAD,
        0x06, 0x18, 0x43, 0x2F, 0xA7, 0xD7, 0xFB, 0x3D, 0x99, 0x00, 0x4D, 0x2B,
        0x0B, 0xDF, 0xC1, 0x4F, 0x80, 0x24, 0x83, 0x2B
    };

    CY_CRYPTO_VU_PUSH_REG (base);

    if(CY_CRYPTO_SUCCESS == Cy_Crypto_Core_EDW_GetCurveParams(edwDp, curveID))
    {
        if ((publicKey != NULL) && (pubKey_x != NULL) && (pubKey_y != NULL))
        {
            uint32_t bitsize  = edwDp->size;
            uint32_t bytesize = CY_CRYPTO_BYTE_SIZE_OF_BITS(edwDp->size);

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
            /* Flush the cache */
            SCB_CleanDCache_by_Addr((volatile void *)publicKey,(int32_t)CY_CRYPTO_BYTE_SIZE_OF_BITS(bitsize));
#endif
            publicKeyRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(publicKey);
            publicKeyXRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(pubKey_x);
            publicKeyYRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(pubKey_y);

            uint32_t p_a = 7u;       /* grp->A */
            uint32_t p_d = 6u;       /* grp->D */
            uint32_t p_x = 3u;       /* pub x coordinate */
            uint32_t p_y = 4u;       /* pub y coordinate */
            uint32_t p_uv = 5u;      /* (u*v) RFC 8032 sec 5.1.3 */

            tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, p_x, bitsize);
            if(CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }

            tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, p_y, bitsize);
            if(CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }

            tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, p_a, bitsize);
            if(CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }
            Cy_Crypto_Core_Vu_SetMemValue (base, p_a, (uint8_t const *)CY_REMAP_ADDRESS_FOR_CRYPTO(edwDp->a), bitsize);

            tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, p_d, bitsize);
            if(CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }
            Cy_Crypto_Core_Vu_SetMemValue (base, p_d, (uint8_t const *)CY_REMAP_ADDRESS_FOR_CRYPTO(edwDp->d), bitsize);

            tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, p_uv, bitsize);
            if(CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }

            /* load prime defining the curve as well as the barrett coefficient. */
            /* VR_P and VR_BARRETT_U are "globally" defined in cy_crypto_core_ecc.h */
            tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, VR_P, bitsize);
            if(CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }
            Cy_Crypto_Core_Vu_SetMemValue (base, VR_P, (uint8_t const *)CY_REMAP_ADDRESS_FOR_CRYPTO(edwDp->prime), bitsize);

            tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, VR_BARRETT, edwDp->barret_psize);
            if(CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }
            Cy_Crypto_Core_Vu_SetMemValue (base, VR_BARRETT, (uint8_t const*)CY_REMAP_ADDRESS_FOR_CRYPTO(edwDp->barrett_p), edwDp->barret_psize);

            /* Recover x_0 and generate p_y*/
            Cy_Crypto_Core_MemCpy(base, (void*)publicKeyYRemap, (void const *)publicKeyRemap, (uint16_t)bytesize);

            x_0 = publicKeyYRemap[31] >> (uint8_t)0x07;
            publicKeyYRemap[31] &= (uint8_t)0x7F;

            /* If the resulting y >= grp->P, decoding fails. */
            Cy_Crypto_Core_Vu_SetMemValue (base, p_y, (uint8_t const *)publicKeyYRemap, bitsize);
            if (!Cy_Crypto_Core_Vu_IsRegLess(base, p_y, VR_P))
            {
                /* p_y is not less than P!!! */
                tmpResult = CY_CRYPTO_BAD_PARAMS;
            }

            /*
            To recover the x-coordinates, the curve equation implies x^2 = (y^2 - 1) / (d y^2 - a) (mod p).
            The denominator is always non-zero mod p. Let u = y^2 - 1 and v = d y^2 - a.
            We compute the square root of (u/v) depending on p (mod 8),for ED25519 its 5. The candidate root is
            x = sqrt(u/v) = u (u v)^((p-5)/8)
            */
            if (CY_CRYPTO_SUCCESS == tmpResult)
            {
                /*y^2*/
                tmpResult = Cy_Crypto_Core_ED25519_SquareMod( base, p_y, p_y, bitsize);
                if(CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                /* dy^2*/
                tmpResult = Cy_Crypto_Core_ED25519_MulMod( base, p_d, p_d, p_y, bitsize);
                if(CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                /* v = (dy^2 - a) */
                Cy_Crypto_Core_EC_SubMod (base, p_d, p_d, p_a);
                /* u = y^2 - 1 */
                CY_CRYPTO_VU_SET_TO_ONE(base, p_x);
                CY_CRYPTO_VU_SUB(base, p_y, p_y, p_x);
                /* compute u*((uv)^((p-5)/8)) mod p */
                Cy_Crypto_Core_Vu_SetMemValue (base, p_x, (uint8_t const *)ed25519_pb8_exp, bitsize);
                tmpResult = Cy_Crypto_Core_ED25519_MulMod( base, p_a, p_d, p_y, bitsize);
                if(CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                tmpResult = Cy_Crypto_Core_ED25519_ExpMod( base, p_uv, p_a, p_x, bitsize);
                if(CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }

                tmpResult = Cy_Crypto_Core_ED25519_MulMod( base, p_uv, p_uv, p_y, bitsize);
                if(CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                /* If v * x^2 = u (mod p), x is a square root. */
                tmpResult = Cy_Crypto_Core_ED25519_SquareMod( base, p_x, p_uv, bitsize);
                if(CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                tmpResult = Cy_Crypto_Core_ED25519_MulMod( base, p_x, p_x, p_d, bitsize);
                if(CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                if (Cy_Crypto_Core_Vu_IsRegEqual(base, p_x, p_y) != true)
                {
                    /* Otherwise if v x^2 = -u (mod p), x * 2^((p-1)/4) is a square
                    * root. */
                    Cy_Crypto_Core_EC_SubMod(base, p_x, VR_P, p_x);
                    if (Cy_Crypto_Core_Vu_IsRegEqual(base, p_x, p_y) != true)
                    {
                        return CY_CRYPTO_BAD_PARAMS;
                    }
                    /* x *= 2^((p-1)/4) */
                    Cy_Crypto_Core_Vu_SetMemValue (base, p_y, (uint8_t const *)ed25519_sqrt_m1, bitsize);
                    tmpResult = Cy_Crypto_Core_ED25519_MulMod( base, p_x, p_uv, p_y, bitsize);
                    if(CY_CRYPTO_SUCCESS != tmpResult)
                    {
                        return tmpResult;
                    }
                }
                else
                {
                    p_x = p_uv;
                }
                /* Use the x_0 bit to select the right square root. */
                if (Cy_Crypto_Core_Vu_IsRegZero(base, p_x) && x_0 == 1u)
                {
                    return CY_CRYPTO_BAD_PARAMS;
                }
                else
                {
                    uint8_t *x = (uint8_t *)Cy_Crypto_Core_Vu_RegMemPointer(base, p_x);

