zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_crypto_core_ecc_eddsa.c
                    if( (x[0] & 0x1u) != x_0)
                    {
                        Cy_Crypto_Core_EC_SubMod(base, p_x, VR_P, p_x);
                    }
                }

                Cy_Crypto_Core_Vu_GetMemValue (base, publicKeyXRemap, p_x, bitsize);
            }

            Cy_Crypto_Core_Vu_WaitForComplete(base);

            CY_CRYPTO_VU_FREE_MEM(base, CY_CRYPTO_VU_REG_BIT(p_x) | CY_CRYPTO_VU_REG_BIT(p_y) |
                                        CY_CRYPTO_VU_REG_BIT(p_a) | CY_CRYPTO_VU_REG_BIT(p_d) |
                                        CY_CRYPTO_VU_REG_BIT(VR_P)| CY_CRYPTO_VU_REG_BIT(p_uv)|
                                        CY_CRYPTO_VU_REG_BIT(VR_BARRETT));

            CY_CRYPTO_VU_POP_REG (base);
        }
    }
    return (tmpResult);
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_ED25519_Verify
****************************************************************************//**
*
* Verify ED25519 signed message.
*
* For CAT1C & CAT1D devices when D-Cache is enabled parameters hash, sig, key(x & y) and sigctx must align and end in 32 byte boundary.
*
* \param base
* The pointer to a Crypto instance.
*
* \param sig
* The signature to verify, 'R' followed by 'S'.
*
* \param hash
* The hash or message that was signed.
*
* \param hashlen
* The length of the hash or message (octets).
*
* \param stat
* Result of signature verification, 0xA1A1A1A1==valid, 0x00BADBAD==invalid.
*
* \param key
* The corresponding uncompressed public key to use (little-endian). See \ref cy_stc_crypto_ecc_key.
*
* \param sigType
* signature Type. CY_CRYPTO_EDDSA_PURE,CY_CRYPTO_EDDSA_CTX or CY_CRYPTO_EDDSA_PREHASH
*
* \param sigctx
* signature context. can be NULL if EDDSA_PURE is used or if no context is provided.
*
* \param sigctx_len
* The length of the signature context
*
* \return status code. See \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_ED25519_Verify(CRYPTO_Type *base, uint8_t *sig, const uint8_t *hash, uint32_t hashlen,
        const cy_stc_crypto_ecc_key *key, uint32_t *stat, cy_en_eddsa_sig_type_t sigType,const uint8_t *sigctx, uint32_t sigctx_len)
{
     cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    uint8_t *sigPtrRemap;
    uint8_t *hashPtrRemap;
    uint8_t *pubKeyXRemap;
    uint8_t *pubKeyYRemap;
    uint32_t mallocMask = 0u;

    cy_stc_crypto_edw_dp_type edwDp_t;
    cy_stc_crypto_edw_dp_type *edwDp = &edwDp_t;

    /*
    Value of context is set by the signer and verifier (maximum of 255
    octets; the default is empty string, except for Ed25519, which can't
    have context) and has to match octet by octet for verification to be
    successful.
    */
    if(sigType == CY_CRYPTO_EDDSA_CTX)
    {
        if( sigctx == NULL  || sigctx_len == 0u || sigctx_len > 255u)
        {
            return CY_CRYPTO_BAD_PARAMS;
        }
    }

    /* input param validation */
    if ((hash == NULL) && (0u != hashlen))
    {
        return CY_CRYPTO_BAD_PARAMS;
    }

    if ((sig != NULL) && (stat != NULL)  && (sigType < CY_CRYPTO_EDDSA_NONE))
    {
        tmpResult = CY_CRYPTO_NOT_SUPPORTED;
        *stat = CY_ED25519SIG_VERIFY_FAIL;

        hashPtrRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(hash);
        sigPtrRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(sig);
        pubKeyXRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(key->pubkey.x);
        pubKeyYRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(key->pubkey.y);

        if(CY_CRYPTO_SUCCESS == Cy_Crypto_Core_EDW_GetCurveParams(edwDp, key->curveID))
        {
#if (CY_IP_MXCRYPTO_VERSION == 1u)
            cy_stc_crypto_v1_sha512_buffers_t shaBuffers_t;
            cy_stc_crypto_sha_state_t shaHashState_t;
            cy_stc_crypto_sha_state_t *shaHashState = &shaHashState_t;
            cy_stc_crypto_v1_sha512_buffers_t *shaBuffers = &shaBuffers_t;
#else
            uint8_t shaBuffers_t[CY_CRYPTO_ALIGN_CACHE_LINE(sizeof(cy_stc_crypto_v2_sha512_buffers_t)) + CY_CRYPTO_DCAHCE_PADDING_SIZE];
            uint8_t shaHashState_t[CY_CRYPTO_ALIGN_CACHE_LINE(sizeof(cy_stc_crypto_sha_state_t)) + CY_CRYPTO_DCAHCE_PADDING_SIZE];
            cy_stc_crypto_v2_sha512_buffers_t *shaBuffers = (cy_stc_crypto_v2_sha512_buffers_t *)CY_CRYPTO_DCAHCE_ALIGN_ADDRESS(shaBuffers_t);
            cy_stc_crypto_sha_state_t *shaHashState = (cy_stc_crypto_sha_state_t *)CY_CRYPTO_DCAHCE_ALIGN_ADDRESS(shaHashState_t);
#endif

            uint32_t bitsize  = edwDp->size;
            uint32_t bytesize = CY_CRYPTO_BYTE_SIZE_OF_BITS(edwDp->size);

            tmpResult = Cy_Crypto_Core_Sha_Init(base, shaHashState, (cy_en_crypto_sha_mode_t)CY_CRYPTO_MODE_SHA512, (void *)shaBuffers);
            if (CY_CRYPTO_SUCCESS == tmpResult)
            {
                tmpResult = Cy_Crypto_Core_Sha_Start(base, shaHashState);
            }

            if (CY_CRYPTO_SUCCESS == tmpResult)
            {
                uint32_t p_sha  = 4u;
                uint32_t p_temp = 5u;
                uint32_t p_r    = 6u;
                uint32_t p_s    = 7u;
                uint32_t p_x    = 8u;
                uint32_t p_y    = 9u;

                uint8_t *digest;
                uint8_t *pubkey_x;
                uint8_t *pubkey_y;
                uint8_t *sig_r;
                uint8_t *sig_s;

                sig_r = &sigPtrRemap[0];
                sig_s = &sigPtrRemap[bytesize];
                tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, p_r, bitsize+1u);
                if(CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                Cy_Crypto_Core_Vu_SetMemValue(base, p_r, (uint8_t const *)sig_r,  bitsize+1u);

                tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, p_s, bitsize+1u);
                if(CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                Cy_Crypto_Core_Vu_SetMemValue(base, p_s, (uint8_t const *)sig_s,  bitsize+1u);

                /*Curve Order*/
                tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, VR_P, bitsize);
                if(CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                Cy_Crypto_Core_Vu_SetMemValue (base, VR_P, (uint8_t const *)CY_REMAP_ADDRESS_FOR_CRYPTO(edwDp->order), bitsize);

                /* Check R and S range */
                if (Cy_Crypto_Core_Vu_IsRegZero(base, p_r))
                {
                    /* R is zero!!! */
                    return CY_CRYPTO_BAD_PARAMS;
                }
                if (Cy_Crypto_Core_Vu_IsRegZero(base, p_s))
                {
                    /* S is zero!!! */
                    return CY_CRYPTO_BAD_PARAMS;
                }

